# StructuralSectionISlopedFlange Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionISlopedFlange Class
Members See Also
---
Defines parameters for I-shape Sloped Flange structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class StructuralSectionISlopedFlange : StructuralSectionGeneralI
```

Visual Basic
---
```text
Public Class StructuralSectionISlopedFlange _
	Inherits StructuralSectionGeneralI
```

Visual C++
---
```text
public ref class StructuralSectionISlopedFlange : public StructuralSectionGeneralI
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionHotRolled Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralI Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionISlopedFlange
# See Also
StructuralSectionISlopedFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace